# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0
  - [-1, 1, Conv, [128, 3, 2]]                   # 1
  - [-1, 1, RepHMS, [128, 2, 1, 3, 3]]           # 2 RepHMS  3x3   P2
  - [-1, 1, Conv, [256, 3, 2]]                   # 3
  - [-1, 1, RepHMS, [256, 3, 1, 3, 5]]           # 4 RepHMS  5x5   P3
  - [-1, 1, SCDown, [512, 3, 2]]                 # 5
  - [-1, 1, RepHMS, [512, 3, 1, 3, 7]]           # 6 RepHMS  7x7   P4
  - [-1, 1, SCDown, [1024, 3, 2]]                # 7
  - [-1, 1, RepHMS, [1024, 2, 1, 3, 9]]          # 8 RepHMS  9x9
  - [-1, 1, SPPF, [1024, 5]]                     # 9
  - [-1, 1, PSA, [1024]]                         # 10  P5

head:
  - [6, 1, AVG, []]                              # 11 P4 进行下采样
  - [[-1, 10], 1, Concat, [1]]                   # 12 与 P5 进行融合
  - [-1, 1, RepHMS, [512, 2, 1, 3, 9]]           # 13 分支3  RepHMS  9x9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 对 分支3 进行上采样
  - [10, 1, nn.Upsample, [None, 2, "nearest"]]   # 15 对 P5 进行上采样
  - [4, 1, AVG, []]                              # 16 对 P3 进行下采样
  - [[-1, 6, -2, -3], 1, Concat, [1]]            # 17 与 P4 进行融合
  - [-1, 1, RepHMS, [384, 2, 1, 3, 7]]           # 18 分支2  RepHMS  7x7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19 对 分支2 进行上采样
  - [6, 1, nn.Upsample, [None, 2, "nearest"]]    # 20 对 P4 进行上采样
  - [2, 1, AVG, []]                              # 21 对 P2 进行下采样
  - [[-1, 4, -2, -3], 1, Concat, [1]]            # 22 与 P3 进行融合
  - [-1, 1, RepHMS, [384, 2, 1, 3, 5]]           # 23 分支1  RepHMS  5x5

  - [18, 1, nn.Upsample, [None, 2, "nearest"]]   # 24 对 分支2 进行上采样
  - [[-1, -2], 1, Concat, [1]]                   # 25 与 分支1 进行融合
  - [-1, 1, RepHMS, [384, 2, 1, 3, 5]]           # 26 Detect head 1

  - [-1, 1, Conv, [384, 3, 2]]                   # 27 对 head 1 进行下采样（跨步下采用）
  - [23, 1, AVG, []]                             # 28 对 分支1 进行下采样
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]   # 29 对 分支3 进行上采样
  - [[-2, -1, 18, -3], 1, Concat, [1]]           # 30 与 分支2 进行融合
  - [-1, 1, RepHMS, [384, 2, 1, 3, 7]]           # 31 Detect head 2

  - [-1, 1, Conv, [384, 3, 2]]                   # 32 对 head 2 进行下采样（跨步下采用）
  - [18, 1, AVG, []]                             # 33 对 分支2 进行下采样
  - [[-2, -1, 13], 1, Concat, [1]]               # 34 与 分支3 进行融合
  - [-1, 1, RepHMS, [512, 2, 1, 3, 9]]           # 35 Detect head 3

  - [[26, 31, 35], 1, v10Detect, [nc]]           # 36