# yolov8_hs_fpn_p1_p4.yaml

# Parameters
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone输出对应关系
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4  -> C1 (HS-FPN的P1输入)
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8  -> C2 (HS-FPN的P2输入)
  - [-1, 6, C2f, [256, True]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16 -> C3 (HS-FPN的P3输入)
  - [-1, 6, C2f, [512, True]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32 -> C4 (HS-FPN的P4输入)
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]     # 9

head:
  # 侧边连接 (1x1卷积降维，使用动态通道数)
  - [1, 1, Conv, [256, 1, 1]]    # 10: C1 lateral -> P1输入
  - [4, 1, Conv, [256, 1, 1]]    # 11: C2 lateral -> P2输入
  - [6, 1, Conv, [256, 1, 1]]    # 12: C3 lateral -> P3输入
  - [9, 1, Conv, [256, 1, 1]]    # 13: C4 lateral -> P4输入

  # HFP自注意力 - 使用动态通道数
  - [13, 1, HFP, [0, 1, 0]]     # 14: Enhanced P4 (no DCT)
  - [12, 1, HFP, [0, 1, 0]]     # 15: Enhanced P3 (no DCT)
  - [11, 1, HFP, [0.25, 8, 1]]  # 16: Enhanced P2 (with DCT)
  - [10, 1, HFP, [0.25, 16, 1]] # 17: Enhanced P1 (with DCT)

  # SDP跨层级注意力 - 使用动态通道数
  - [[16, 15], 1, SDP, []]    # 18: P2-P3 attention
  - [[17, 18], 1, SDP, []]    # 19: P1-P2 attention

  # 最终3x3卷积 - 使用动态通道数
  - [14, 1, Conv, [256, 3, 1]]   # 20: Final P4
  - [15, 1, Conv, [256, 3, 1]]   # 21: Final P3
  - [19, 1, Conv, [256, 3, 1]]   # 22: Final P2
  - [17, 1, Conv, [256, 3, 1]]   # 23: Final P1

  # 检测头输出 P1-P4
  - [[23, 22, 21, 20], 1, Detect, [nc]]  # 24: Detect(P1, P2, P3, P4)