# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
# 统一：Re + head
backbone:
  # 640 x 640 x 3
  # [from, repeats, module, args]
  - [-1, 1, ESSamp, [3, 64]] # 0-P1/2          320 x 320 x 64
  - [-1, 1, ESSamp, [64, 128]] # 1-P2/4        160 x 160 x 128
  - [-1, 2, C3k2, [256, False, 0.25]] #        160 x 160 x 256
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8        80 x 80 x 256
  - [-1, 2, C3k2, [512, False, 0.25]] #        80 x 80 x 512
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16       40 x 40 x 512
  - [-1, 2, C3k2, [512, True]] #               40 x 40 x 512
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32      20 x 20 x 1024
  - [-1, 2, C3k2, [1024, True]] #              20 x 20 x 1024
  - [-1, 1, SPPF, [1024, 5]] # 9               20 x 20 x 1024
  - [-1, 2, C2PSA, [1024]] # 10                20 x 20 x 1024

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P5 -> P4     40 x 40 x 1024
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4               40 x 40 x (1024 + 512 = 1536)
  - [-1, 2, C3k2, [512, True]] # 13 (p4/16)                   40 x 40 x 512

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P4 -> P3     80 x 80 x 512
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3               80 x 80 x (512 + 256 = 768)
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)             80 x 80 x 256

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # P3 -> P2     160 x 160 x 256
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2               160 x 160 x (256 + 128 = 384)
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-small)             160 x 160 x 128

# 第二轮

  - [-1, 1, Conv, [256, 3, 2 ] ] # P2 -> P3                   80 x 80 x 256
  - [-1, 2, C3k2, [512, True]] # 21 p3/8                      80 x 80 x 512

  - [[-1, 4], 1, Concat, [1]] #                               80 x 80 x (512 + 512 = 1024)
  - [ -1, 2, C3k2, [256, False]] #                            80 x 80 x 256

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #/24 P3 -> P2  160 x 160 x 256
  - [[2, 19], 1, Concat, [1]] #                               160 x 160 x (256 + 128 = 384)
  - [[-1, 24], 1, Concat, [1]] #                              160 x 160 x (384 + 256 = 640)
  - [-1, 2, C3k2, [256, False]] # 27 (P2/4)                   160 x 160 x 256

# 第三轮

  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # P2 -> P3                 80 x 80 x 128
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # P3 -> P4                 40 x 40 x 256
  - [ -1, 2, C3k2, [ 512, False ] ] # 30 p4 /16               40 x 40 x 512

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # /8           80 x 80 x 512
  - [[-1, 4], 1, Concat, [1]] #                               80 x 80 x (512 + 512 = 1024)
  - [ -1, 2, C3k2, [ 256, False ] ] # 33 p3 /8                80 x 80 x 256

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 34 /4        160 x 160 x 256
  - [[2, 27], 1, Concat, [1]] #                               160 x 160 x (256 + 256 = 512)
  - [[-1, 34], 1, Concat, [1]] #                              160 x 160 x (512 + 256 = 768)
  - [-1, 2, C3k2, [128, False]] # 37 (P2/4-small)             160 x 160 x 128

  - [[37, 33, 30], 1, Detect, [nc]] # Detect(P2, P3, P4)
